app/views/questions/_answers.html.slim

- @question.answers.order(best: :desc).each do |answer|
---
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 AND "answers"."best" = $2 ORDER BY "answers"."id" ASC LIMIT $3  [["question_id", 4], ["best", "t"], ["LIMIT", 1]]

      ul
      - answer.attachments.each do |a|
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."question_id" = $1  [["question_id", 4]]