app/views/answers/_answers.html.slim

- @question.answers.order(best: :desc).each do |answer|
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."best" DESC  [["question_id", 67]]