app/controllers/answers_controller.rb

INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "V den`gah"], ["question_id", 1], ["created_at", "2018-05-17 13:40:07.261329"], ["updated_at", "2018-05-17 13:40:07.261329"], ["user_id", 1]]
---
  def create
    # @answer = @question.answers.new(answer_params)
    # @answer.user_id = current_user.id
    # respond_to do |format|
    #   if @answer.save!
    #     format.js
    #   else
    #     format.js { render json: @answer.errors.full_messages, status: :unprocessable_entity }
    #   end
    #   gon.watch.answers = @answer.question.answers
    # end
    respond_with(@answer = @question.answers.create(answer_params.merge({ user: current_user })))

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "answers" SET "body" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["body", "edited"], ["updated_at", "2018-06-01 06:55:02.648814"], ["id", 23]]
---
  def update
     @answer = Answer.find(params[:id])
     @answer.update(answer_params)

DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 4]]
---
  def destroy
    if @answer.user_id == current_user.id
      @answer.destroy

DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 11]]
---
  def best
    if current_user.author_of?(@answer.question)
      # @answer.best
      # flash[:notice] = 'Choose the best answer'
      # @question = @answer.question
    end
     respond_with(@answer.destroy)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def load_question
    @question = Question.find(params[:question_id])

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_answer
    @answer = Answer.find(params[:id])