app/controllers/attachments_controller.rb

  def destroy
    respond_with(@attachment.destroy) if current_user.author_of?(@attachment.attachable)
---
DELETE FROM "attachments" WHERE "attachments"."id" = $1  [["id", 6]]

  def set_attachment
    @attachment = Attachment.find(params[:id])
---
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]