app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(commentable: @commentable, user_id: current_user.id, comment_body: params[:comment][:comment_body])
    @question = @comment.commentable_type == 'Question' ? @comment.commentable : @comment.commentable.question
    @comment.save!
---
INSERT INTO "comments" ("user_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["commentable_type", "Question"], ["commentable_id", 2], ["created_at", "2018-07-17 12:01:34.960727"], ["updated_at", "2018-07-17 12:01:34.960727"]]

  def load_commentable
    @commentable = params[:question_id] ? Question.find(params[:question_id]):Answer.find(params[:answer_id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]