app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "V chem sila brat?"], ["body", "V chem sila brat?"], ["created_at", "2018-05-17 13:39:49.492914"], ["updated_at", "2018-05-17 13:39:49.492914"], ["user_id", 1]]
---
  def create
    respond_with(@question = current_user.questions.create(question_params))

UPDATE "questions" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["title", "Ttle_test_new os"], ["body", "text_test. I had new os. what I gonna do?"], ["updated_at", "2018-06-30 11:47:32.544893"], ["id", 9]]
---
  def update
     @question.update(question_params)

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]
---
  def destroy
    if current_user.id == @question.user_id
      respond_with(@question.destroy)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def load_question
    @question = Question.find(params[:id])