app/controllers/votes_controller.rb

DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 25]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."votable_type" = 'Answer' AND "votes"."votable_id" = 11 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def unvote
    @vote = Vote.find_by(user_id: current_user.id, votable: @votable)
    if @vote && current_user.author_of?(@vote)
      @vote.destroy
      render json: { count_votes: @vote.votable.count_votes, votable_type: @vote.votable_type, votable_id: @vote.votable_id }